IDENTIFICATION DIVISION.
PROGRAM-ID.F.
DATA DIVISION.
WORKING-STORAGE SECTION.
1 I PIC 999.
1 S PIC ZZ9.
PROCEDURE DIVISION.
PERFORM VARYING I FROM 1 BY 1 UNTIL I > 100
MOVE I TO S
EVALUATE TRUE
WHEN FUNCTION MOD(I 15) = 0 DISPLAY "FizzBuzz"
WHEN FUNCTION MOD(I 3) = 0 DISPLAY "Fizz"
WHEN FUNCTION MOD(I 5) = 0 DISPLAY "Buzz"
WHEN OTHER DISPLAY FUNCTION TRIM(S)
END-EVALUATE
END-PERFORM.
STOP RUN.
